src/xmls/initiate.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:api="http://cps.huawei.com/cpsinterface/api_requestmgr" xmlns:req="http://cps.huawei.com/cpsinterface/request" xmlns:com="http://cps.huawei.com/cpsinterface/common">
  <soapenv:Header/>
  <soapenv:Body>
    <api:Request>
      <req:Header>
        <req:Version>1.0</req:Version>
        <req:CommandID>InitTrans_Initiate Direct Debit Transaction</req:CommandID>
        <req:OriginatorConversationID>S_X2013012921001</req:OriginatorConversationID>
        <req:Caller>
          <req:CallerType>2</req:CallerType>
          <req:ThirdPartyID>POS_Broker</req:ThirdPartyID>
          <req:Password>B1YNY8GylVo=</req:Password>
          <req:ResultURL>http://10.71.109.150:8888/mockResultBinding</req:ResultURL>
        </req:Caller>
        <req:KeyOwner>1</req:KeyOwner>
        <req:Timestamp>20130402152345</req:Timestamp>
      </req:Header>
      <req:Body>
        <req:Identity> 
          <req:Initiator> 
            <req:IdentifierType>11</req:IdentifierType> 
            <req:Identifier>aaa</req:Identifier> 
            <req:SecurityCredential>iUoiP9iGVwE=</req:SecurityCredential> 
            <req:ShortCode>1008</req:ShortCode>
          </req:Initiator>
          <req:ReceiverParty>
            <req:IdentifierType>53</req:IdentifierType>
            <req:Identifier>1111</req:Identifier>
          </req:ReceiverParty>
        </req:Identity>
        <req:TransactionRequest>
          <req:Parameters>
            <req:Parameter>
              <com:Key>MandateID</com:Key>
              <com:Value>10001</com:Value>
            </req:Parameter>
            <req:Parameter>
              <com:Key>Amount</com:Key>
              <com:Value>100.00</com:Value>
            </req:Parameter>
            <req:Parameter>
              <com:Key>Currency</com:Key>
              <com:Value>USD</com:Value>
            </req:Parameter>
          </req:Parameters>
        </req:TransactionRequest>
        <req:Remark>1212</req:Remark>
      </req:Body>
    </api:Request>
  </soapenv:Body>
</soapenv:Envelope>
