src/xmls/cancel.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:api="http://cps.huawei.com/cpsinterface/api_requestmgr" xmlns:req="http://cps.huawei.com/cpsinterface/request" xmlns:com="http://cps.huawei.com/cpsinterface/common">
   <soapenv:Header/>
   <soapenv:Body>
      <api:Request>
         <req:Header>
            <req:Version>1.0</req:Version>
            <req:CommandID>CancelCustomerDirectDebitMandateByPayer</req:CommandID>
            <req:OriginatorConversationID>S_X20190625202317</req:OriginatorConversationID>
            <req:Caller>
               <req:CallerType>2</req:CallerType>
               <req:ThirdPartyID>POS_Broker</req:ThirdPartyID>
               <req:Password>guQOmb66A6HRGIwZHqCiFrI5IJB/o7Cj8DKPbSnILwZ3szmaZp1uIvn1pDAxCFQ9laaQF7LcekovCI0CT7hiNA==</req:Password>
               <req:ResultURL>http://10.25.68.172:8688/mockAPIResultMgrBinding</req:ResultURL>
            </req:Caller>
            <req:KeyOwner>1</req:KeyOwner>
            <req:Timestamp>20190625202317</req:Timestamp>
         </req:Header>
         <req:Body>
            <req:Identity>
               <req:Initiator>
                  <req:IdentifierType>14</req:IdentifierType>
                  <req:Identifier>0000</req:Identifier>
                  <req:SecurityCredential>yeZchuDV/vamwswucSwm4ziZZZm6ogcm40eFAIc7H69e76ZT/CibWDWac6uE14cWzB7qiFHlW/4JL1EzBLMj7g==</req:SecurityCredential>
               </req:Initiator>
               <req:ReceiverParty>
                  <req:IdentifierType>1</req:IdentifierType>
                  <req:Identifier>8610000087004</req:Identifier>
               </req:ReceiverParty>
            </req:Identity>
            <req:CancelDirectDebitMandateByPayerRequest>
               <req:MandateID>12502</req:MandateID>
            </req:CancelDirectDebitMandateByPayerRequest>
         </req:Body>
      </api:Request>
   </soapenv:Body>
</soapenv:Envelope>



